"===============Переманные==============="
# переменные - это имменновванные ссылки на ячейки памяти , где хранятся какие-то данные, для дальнейшего использования 
num1 = 5
num2 = 10
print(num1+num2)
"================Ввод и вывод данных================"
# INPUT- ФУНКЦИЯ , которая позволяет принимать данные с терминала
# print - фнукция которая позволяет ввыводить данные в терминале
number = input("Введите число: ")
print("ВВеденное число -" , number)
"===============Правила наименования переменных==============="
a = 5 # можно , но не совсем понятно
# 1num = 10 нельзя начинать с чисел
hello_world =" hello world"#для разделителя можно использовать только (_)
#print='print' # нелзя назвать переменные уже встроенными названиями
#Snake case -знерщт стиль написания перемынных
HEllo_world_22=''
#Camel Case-стиль написания переменных во всех других яп
heeLLOWorLD=''
"++++++++++++Типа данных Python++++++++++++"
#не изменяемые типы данных
int_ = 17
float_ =34.7
str_='Salam'
bool_1 =True
bool_2 =False
none_=None
turple_=(1,2,3,4,5,6,7,8,9,10)
# изменяемые типы данных
list_=[1,2,3,4,5,6,7,8,9,10]
set_= {1,3,1,4}#{1,2,4}
dict_={'a':1, 'b':2,'c':3}
